/* [ct2cs 21/5/23 00:09]
 * This file was generated by Fahrenheit.CT2CS (https://github.com/fkelava/fahrenheit/).
 * 
 * Source file: x_btlactor.ct
 */

namespace Fahrenheit.CoreLib;

[StructLayout(LayoutKind.Explicit, Pack = 1, Size = 0xC)]
public struct FhXChrItemLoot {
	[FieldOffset(0x0)] public ushort item_primary_common;
	[FieldOffset(0x2)] public ushort item_primary_rare;
	[FieldOffset(0x4)] public ushort item_secondary_common;
	[FieldOffset(0x6)] public ushort item_secondary_rare;
	[FieldOffset(0x8)] public byte amount_primary_common;
	[FieldOffset(0x9)] public byte amount_primary_rare;
	[FieldOffset(0xA)] public byte amount_secondary_common;
	[FieldOffset(0xB)] public byte amount_secondary_rare;
}

[StructLayout(LayoutKind.Explicit, Pack = 1, Size = 0x9)]
public struct FhXChrStealLoot {
	[FieldOffset(0x0)] public ushort item_common;
	[FieldOffset(0x2)] public ushort item_rare;
	[FieldOffset(0x4)] public byte amount_common;
	[FieldOffset(0x5)] public byte amount_rare;
	[FieldOffset(0x6)] public ushort item_bribe;
	[FieldOffset(0x8)] public byte amount_bribe;
}

[StructLayout(LayoutKind.Explicit, Pack = 1, Size = 0x20)]
public unsafe struct FhXChrGearLootAbilities {
	[FieldOffset(0x0)] public fixed ushort weapon_abilities[8];
	[FieldOffset(0x10)] public fixed ushort armor_abilities[8];
}

[StructLayout(LayoutKind.Explicit, Pack = 1, Size = 0xE5)]
public struct FhXChrGearLoot {
	[FieldOffset(0x0)] public byte slot_count;
	[FieldOffset(0x1)] public byte dmg_formula;
	[FieldOffset(0x2)] public byte crit_bonus;
	[FieldOffset(0x3)] public byte power;
	[FieldOffset(0x4)] public byte ability_count;
	[FieldOffset(0x5)] public FhXChrGearLootAbilities tidus_abilities;
	[FieldOffset(0x25)] public FhXChrGearLootAbilities yuna_abilities;
	[FieldOffset(0x45)] public FhXChrGearLootAbilities auron_abilities;
	[FieldOffset(0x65)] public FhXChrGearLootAbilities kimahri_abilities;
	[FieldOffset(0x85)] public FhXChrGearLootAbilities wakka_abilities;
	[FieldOffset(0xA5)] public FhXChrGearLootAbilities lulu_abilities;
	[FieldOffset(0xC5)] public FhXChrGearLootAbilities rikku_abilities;
}

[StructLayout(LayoutKind.Explicit, Pack = 4, Size = 0x118)]
public unsafe struct FhXChrLoot {
    [FieldOffset(0x0)] public ushort gil;
    [FieldOffset(0x2)] public ushort ap;
    [FieldOffset(0x4)] public ushort ap_overkill;
    [FieldOffset(0x6)] public ushort ronso_rage;

    [FieldOffset(0x8)] public byte drop_chance_primary;
    [FieldOffset(0x9)] public byte drop_chance_secondary;
    [FieldOffset(0xA)] public byte steal_chance;
    [FieldOffset(0xB)] public byte drop_chance_gear;

	[FieldOffset(0xC)] public FhXChrItemLoot item_loot;
	[FieldOffset(0x18)] public FhXChrItemLoot item_loot_overkill;
	[FieldOffset(0x24)] public FhXChrStealLoot steal_loot;
	[FieldOffset(0x2D)] public FhXChrGearLoot gear_loot;

    [FieldOffset(0x112)] public byte zanmato_level;
}

