/* [fkelava 13/9/22 08:16]
 * source: MS Store ver.
 * header: __chr_pc_h
 *
 * /ffx_ps2/ffx/proj2/chr/ath/pc.ath
 */

namespace Fahrenheit.CoreLib.FFX;

public enum PcId : T_XPcId
{
    C001        = 0x1,   // ティーダ／３０００／標準服
    CHR_TIDU    = C001,
    C002        = 0x2,   // ユウナ／３０００／標準服
    CHR_YUNA    = C002,
    C003        = 0x3,   // アーロン／３０００／標準服
    CHR_AURO    = C003,
    C004        = 0x4,   // キマリ／３０００／標準服
    CHR_KIMA    = C004,
    C005        = 0x5,   // ワッカ／３０００／標準服
    CHR_WAKK    = C005,
    C006        = 0x6,   // ルールー／３０００／標準服
    CHR_LULU    = C006,
    C007        = 0x7,   // リュック／３０００／標準服
    CHR_RIKK    = C007,
    C008        = 0x8,   // シーモア／３０００／標準服
    CHR_SEYM    = C008,
    C041        = 0x29,  // リュック／３０００／アルベト服
    CHR_RIKK_A  = C041,
    C043        = 0x2B,  // ユウナ／３０００／婚礼衣装
    CHR_YUNA_B  = C043,
    C044        = 0x2C,  // シーモア／３０００／婚礼衣装
    CHR_SEYM_B  = C044,
    C045        = 0x2D,  // アーロン／３０００／１０年前
    CHR_AURO_Y  = C045,
    C046        = 0x2E,  // ワッカ／３０００／ボロボロ
    CHR_WAKK_D  = C046,
    C051        = 0x33,  // リュック／８００／アルベト服（削除）
    CHR_RIKK_LA = C051,
    C101        = 0x65,  // ティーダ／１００００／標準服
    CHR_TIDU_H  = C101,
    C102        = 0x66,  // ユウナ／１００００／標準服
    CHR_YUNA_H  = C102,
    C103        = 0x67,  // アーロン／１００００／標準服
    CHR_AURO_H  = C103,
    C104        = 0x68,  // キマリ／１００００／標準服
    CHR_KIMA_H  = C104,
    C105        = 0x69,  // ワッカ／１００００／標準服
    CHR_WAKK_H  = C105,
    C106        = 0x6A,  // ルールー／１００００／標準服
    CHR_LULU_H  = C106,
    C107        = 0x6B,  // リュック／１００００／標準服
    CHR_RIKK_H  = C107,
    C108        = 0x6C,  // シーモア／１００００／標準服
    CHR_SEYM_H  = C108,
    C121        = 0x79,  // ユウナ／１００００／婚礼衣装
    CHR_YUNA_HB = C121,
    C122        = 0x7A,  // シーモア／１００００／婚礼衣装
    CHR_SEYM_HB = C122,
    C901        = 0x385, // ティーダテスト
    C902        = 0x386, // ユウナテスト
    C903        = 0x387, // アーロンテスト
    C904        = 0x388, // キマリテスト
    C905        = 0x389, // ワッカテスト
    C906        = 0x38A, // ルールーテスト
    C907        = 0x38B, // リュックテスト
    C908        = 0x38C, // シーモアテスト
    C921        = 0x399, // ユウナ婚礼衣装テスト
    C922        = 0x39A, // シーモア婚礼衣装テスト
    C999        = 0x3E7,  // ハイポリテスト
}