/* [fkelava 13/9/22 08:16]
 * source: MS Store ver.
 * header: __chr_skl_h
 *
 * /ffx_ps2/ffx/proj2/chr/ath/skl.ath
 */

namespace Fahrenheit.CoreLib.FFX;

public enum XSklId : T_XSklId
{
    K001 = 0x6001, // 子供
    K002 = 0x6002, // 男青年（細身）
    K003 = 0x6003, // 男青年（太身）
    K004 = 0x6004, // 男大人
    K005 = 0x6005, // 男中年（細身）
    K006 = 0x6006, // 男中年（太身）
    K007 = 0x6007, // 男高齢
    K012 = 0x600C, // 女青年（細身）
    K013 = 0x600D, // 女青年（太身）
    K014 = 0x600E, // 女大人
    K015 = 0x600F, // 女中年（細身）
    K016 = 0x6010, // 女中年（太身）
    K017 = 0x6011, // 女高齢
    K066 = 0x6042, // ティーダ盾１（設定画の盾）
    K101 = 0x6065, // ロンゾ子供
    K102 = 0x6066, // ロンゾ男大人
    K103 = 0x6067, // ロンゾ男大人（ブリッツ選手）
    K104 = 0x6068, // ロンゾ男高齢
    K112 = 0x6070, // ロンゾ女大人
    K113 = 0x6071, // ロンゾ女大人（ブリッツ選手）
    K114 = 0x6072, // ロンゾ女高齢
    K201 = 0x60C9, // グアド子供
    K202 = 0x60CA, // グアド男大人
    K203 = 0x60CB, // グアド男大人（ブリッツ選手）
    K204 = 0x60CC, // グアド男高齢
    K212 = 0x60D4, // グアド女大人
    K213 = 0x60D5, // グアド女大人（ブリッツ選手）
    K214 = 0x60D6, // グアド女高齢
    K301 = 0x612D, // ハイペロ子供
    K302 = 0x612E, // ハイペロ大人
    K303 = 0x612F, // ペルペル
    K304 = 0x6130, // アナウンサー（ペルペル）
    K401 = 0x6191, // 楽器亜人種１
    K402 = 0x6192, // 楽器亜人種２
    K403 = 0x6193, // 楽器亜人種３
    K501 = 0x61F5, // ジスカル＝グアド
    K502 = 0x61F6, // ユウナレスカ
    K503 = 0x61F7, // ブラスカ
    K504 = 0x61F8, // 野村キャラクター流用（暫定）
    K505 = 0x61F9, // ジェクト
    K998 = 0x63E6, // 杉本テスト2
    K999 = 0x63E7, // 杉本テスト
}